# -----------------------------------------------------------------------------
# Settings
# -----------------------------------------------------------------------------
cask_args appdir: "/Applications"

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "r-lib/rig"

# -----------------------------------------------------------------------------
# Formula
# -----------------------------------------------------------------------------
brew "cmake"
brew "gh"
brew "git"
brew "mas"
brew "nvm"
brew "powerlevel10k"
brew "pyenv"
brew "pyenv-virtualenv"
brew "xz"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# -----------------------------------------------------------------------------
# Applications
# -----------------------------------------------------------------------------
cask "adobe-creative-cloud"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "jellyfin-media-player"
cask "jetbrains-toolbox"
cask "mendeley"
cask "notion"
cask "rig"
cask "rstudio"
cask "the-unarchiver"
cask "tiles"
cask "visual-studio-code"
cask "zoom"

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-lora"
cask "font-montserrat"
cask "font-open-sans"
cask "font-oswald"
cask "font-playfair-display"
cask "font-poppins"
cask "font-raleway"
cask "font-roboto"
cask "font-roboto-serif"

# -----------------------------------------------------------------------------
# Mac App Store applications
# -----------------------------------------------------------------------------
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Friendly Streaming", id: 553245401
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Parcel", id: 639968404
mas "Qantas", id: 1468230799
